{
    "basic": {
        "description": "Marketers are truly living in the era of ¿big data.¿ Technology and marketing innovation has enabled a deluge of information and data points about consumer behavior and consumer relationships with brands.   Organizations today expect their marketing executives to come equipped with skills to transform information to insights and insights to shrewd judgment. This is an application-based course designed to give you that edge.  Particularly valuable to 3rd and 4th year students with interest in consulting or marketing careers, the course sets out to equip students with the ability to make better marketing strategy and resource allocation decisions using marketing models developed by academic and consulting communities over the years. \nThrough an entirely hands-on approach students, by the end of the term, will be able to make sense of the information and knowledge available and create marketing strategy and programs based on both quantitative and qualitative factors. Via cases and real-life applications, you will 1) generate operational plans on important marketing decisions such as segmentation, targeting, positioning, marketing resource allocation, forecasting, advertising, pricing, sales promotion, web analytics and web usage optimization; 2) master the selection and use of various models and industry standard commercial software, and 3) develop confidence and skills to successfully justify your strategic and tactical marketing decisions based on marketing analytics.",
        "number": "433",
        "subject": "COMM",
        "title": "Marketing Analytics"
    },
    "extra": {
        "CEAB": {
            "Basic Sci": 0,
            "Comp St": 0,
            "Eng Des": 0,
            "Eng Sci": 0,
            "Math": 0
        },
        "career": "Undergraduate",
        "course_components": {
            "Lecture": "Required"
        },
        "enrollment_requirement": "(Prerequisite of COMM131 OR COMM231 and registered in a BCOM Academic Program and have a level > or equal to 3) or registered in a COMM-X Academic Plan.",
        "grading_basis": "Graded",
        "units": "3.00"
    }
}