{
    "basic": {
        "description": "The course is organized and managed to duplicated a professional serices firm. Typical projects result in changes such as improving productivity, enhancing morale, reducing expenses, boosting cash flows, augmenting Internet and e-marketing resources, implementing marketing reserach, increasing client retention, strenghening brand awareness for the organization or its products and services.  There are no formal classes but consulting firm meetings to discuss client progress, methodological challenges and to review and rehearse client presentations and decisions regarding key client deliverables.  While the methodologies and final deliverables are reviewed for quality purposes by the professor, the final deliverables are the reponsibility of the consultants and are independently developed. Once selected for the course the students sign a contact outlining duties as well as personal learning and experiential objectives.  The student will be evaluated by the professor on the same basis as a member of a professional services firm.  Key performance attributes include technical skills such as analytical, writing and presentation skills as well as administration and project management effectiveness. Soft skills evaluated include engagement and contribution to the firm, leadership, team effectiveness/collaboration, professionalism and client relationships.  Considerable emphasis is placed on the success of the client engagement as assessed by the professor through a formal client feedback and client satisfaction survey. Since this independent study is both project-and-client based, it is very rewarding, but demanding.  Students will apply and improve skills related to delivery and management of professional services, and the integration of virtually all subject matter from previous courses.  Students considering a career in consulting or professional service, with previous experience in managing projects, who enjoy interacting with business people, who thrive in fluid and ever-changing project cultures, who value the importance of fostering innovative or creative environments, are strongly encouraged to apply.",
        "number": "504",
        "subject": "COMM",
        "title": "Is In Consult & Prof. Service"
    },
    "extra": {
        "CEAB": {
            "Basic Sci": 0,
            "Comp St": 0,
            "Eng Des": 0,
            "Eng Sci": 0,
            "Math": 0
        },
        "career": "Undergraduate",
        "course_components": {
            "Lecture": "Required"
        },
        "enrollment_requirement": "Pre for COMM504",
        "grading_basis": "Graded",
        "typically_offered": "Fall",
        "units": "3.00"
    }
}