{
    "basic": {
        "description": "This course provides students the opportunity of consulting for, and working with, owners, managers and staff of small and medium-sized buinsesses as well as professionals from not-for-profit and public organizations.  Studetns work in consulting teams to resolve real-life management challenges or to implement business innovations.  Typical projects result in changes such as improving productivity, enhancing morale, reducing expenses, boosting cash flows, augmenting Internet and emarketing resources, implementing marketing research, increasing client retention, strengthening brand awareness for the organization or its products and services.  Classes are highly interactive and combine consulting-specific course materials, guest speakers, and roundtable discussions and brainstorming sessions.  Since this course is both project-and-client based, it is very rewarding, but demanding.  Students will apply and improve skills related to project management, presenting, critical thinking, report writitngm and multi-functional integration (i.e., combining many business subjects).  Grading will be based on a combination of course contribution plus the excellence of completed projects.  Students with previous experience in managing projects, who enjoy interacting with business people, who thrive in fluid and ever-changing project cultures, who value the importance of fostering innovative or creative environments, or who are considering a career in consuliting, are strongly encouraged to apply.", 
        "number": "404", 
        "subject": "COMM", 
        "title": "Small Business Consulting"
    }, 
    "extra": {
        "CEAB": {
            "Basic Sci": 0, 
            "Comp St": 0, 
            "Eng Des": 0, 
            "Eng Sci": 0, 
            "Math": 0
        }, 
        "career": "Undergraduate", 
        "course_components": {
            "Lecture": "Required"
        }, 
        "enrollment_requirement": "Prerequisite     This course is restricted to students enrolled in the third and fourth year of their program.", 
        "grading_basis": "Graded", 
        "typically_offered": "Fall", 
        "units": "3.00"
    }
}