{
    "extra": {
        "typically_offered": "Winter", 
        "course_components": {
            "Lecture": "Required"
        }, 
        "enrollment_requirement": "Registered in a BCOM Academic Program and have a level > or equal to 3 or registered in a COMM-X Academic Plan.", 
        "CEAB": {
            "Basic Sci": 0, 
            "Math": 0, 
            "Eng Des": 0, 
            "Eng Sci": 0, 
            "Comp St": 0
        }, 
        "career": "Undergraduate", 
        "grading_basis": "Graded", 
        "units": "3.00"
    }, 
    "basic": {
        "description": "What is social innovation?Social Innovations can be defined as ¿new ideas that resolve existing social, cultural, economic and environmental challenges for the benefit of people and planet. A true social innovation is systems-changing ¿ it permanently alters the perceptions, behaviours and structures that previously gave rise to these challenges¿ (Center for Social Innovation). Examples of social innovations include The Grameen Bank, a non-traditional bank that makes micro-loans to poor populations around the globe. It was funded in Bangladesh by Mohammad Yunnus, who received the Nobel Peace Prize in 2006. Another example is Kiva.org, a web-based system that directly connects small entrepreneurs in emerging countries to lenders anywhere on the globe, who can make an interest-free loan of as little as $25 to the project and entrepreneur of their choice. There are many social innovations around us, some of which have already changed the lives of many, providing better access to credit, health services, or community-building. Many more social innovations yet remain to be invented and scaled up. Course objectives:  After taking this course, students should be able to:1) Understand the basic concepts of systems thinking and social innovation; 2) apply those concepts to compare various social innovation projects; 3)design, implement and evaluate a social innovation initiative. We will spend a lot of time in this class discussing real social innovations and the current challenges that they face. During class discussion and assignments you will experiment with various ways to describe complex social systems, analyze them, prescribe interventions, and discuss implementation issues.You will also have a chance to interview social entrepreneurs and assess their project. And you will have the opportunity to try being a social entrepreneur yourself, on a project which your group will design ¿ on the scale of your group's choice.", 
        "subject": "COMM", 
        "number": "402", 
        "title": "Business Policy II"
    }
}