{
    "basic": {
        "description": "This course studies diversity and difference in the workplace, and emphasizes the importance of equity and inclusivity in modern organizations.  It examines individual and organizational experiences of social identity and intersecting identities in contemporary society.  Students will study multiple facets of gender diversity (including gender, gender identity and expression, and sexual orientation), as well as other dimensions of diversity (including race, ethnicity, age, religion, and class).  Students will become familiar with demographic trends in today¿s organizations, related employment law, best practices for hiring and promotion in order to maintain and leverage benefits of organizational diversity, theories and research on how gender and diversity affect organizational interaction and performance, and ongoing issues involved in managing diversity within organizations.  Classes are discussion-focused and assignments are designed to help students build informed opinions that incorporate systematic research and evidence on the topic of gender and diversity in organizations.  The course will help students grow comfortable discussing, addressing, and managing issues of gender and diversity in their careers and organizations.  Students are expected to bring a high level of maturity, sensitivity, and critical thinking to the course.\n\tThis course is restricted to students enrolled in the 3rd or 4th year of the Commerce Program.",
        "number": "356",
        "subject": "COMM",
        "title": "Gender and Diversity in Organizations"
    },
    "extra": {
        "CEAB": {
            "Basic Sci": 0,
            "Comp St": 0,
            "Eng Des": 0,
            "Eng Sci": 0,
            "Math": 0
        },
        "career": "Undergraduate",
        "course_components": {
            "Lecture": "Required"
        },
        "enrollment_requirement": "3Prerequisite     Level 3 or above",
        "grading_basis": "Graded",
        "units": "3.00"
    }
}