{
    "basic": {
        "description": "The course is based on the notion that managerial competence is a function of knowledge, skills, and experience relevant to management. The purpose of this course is to develop skills in diagnosing situations that require change in organizational life and to facilitate such changes. Within the context of organizational behavior, the course will emphasize the acquisition of personal, interpersonal, and group skills that are required to manage people effectively in modern organizations. The interface between theory and practice in the fields of organizational behavior and human resources management will serve as the backdrop for management training in this course. The orientation of the course will be targeted toward managing superiors, peers and subordinates through a process of change. The focus will be at the individual and group levels of analyses. The course is delivered in a workshop format with the emphasis on the acquisition and development of people skills ready to be implemented in a manufacturing context. This is a course dealing primarily with the acquisition of skills and the student is expected to have a basic grasp of issues, concepts, and applications of general management and organizational behaviour in order to fully benefit from what is offered here. At the end of the course participants will have acquired a basic understanding of the skills necessary for effective management of human resources in an organization. (Instructor:  Vishwanath Baba, McMaster)", 
        "number": "872", 
        "subject": "DM", 
        "title": "Management Skills Development"
    }, 
    "extra": {
        "CEAB": {
            "Basic Sci": 0, 
            "Comp St": 0, 
            "Eng Des": 0, 
            "Eng Sci": 0, 
            "Math": 0
        }, 
        "career": "Graduate", 
        "course_components": {
            "Lecture": "Required"
        }, 
        "grading_basis": "Graded", 
        "units": "3.00"
    }
}