{
    "extra": {
        "career": "Graduate", 
        "CEAB": {
            "Basic Sci": 0, 
            "Math": 0, 
            "Eng Des": 0, 
            "Eng Sci": 0, 
            "Comp St": 0
        }, 
        "grading_basis": "Graded", 
        "course_components": {
            "Seminar": "Required"
        }, 
        "units": "3.00"
    }, 
    "basic": {
        "description": "Patents are essential to the protection of innovation in many industrial sectors including manufacturing, pharmaceuticals, aerospace and information and technology. A number of international and bilateral agreements seek to ¿harmonize¿ the patent protection available worldwide.  Nations become signatories to such agreements, in part, in an effort to attract capital and jobs.  This course will provide an overview of the Canadian law of patents for invention.  We will review the historical development of patents for invention, briefly discuss the interrelationship between patents and other branches of Canadian IP law such as trade secrets, industrial designs, integrated circuit topographies, plant breeder's rights, copyrights and trade-marks and consider the formalities of filing a patent application in Canada.  We will explore the basic principles of the patent system in Canada, namely patentable subject matter, novelty, inventive step, utility and sufficiency of the patent specification and discuss the various mechanisms for modifying a granted patent.  We will study the enforcement of one's rights, whether by action for infringement, by licence and assignment or by the Notice of Compliance regime in place for pharmaceutical products.  Finally, we will briefly contrast differences in the patent procurement and enforcement schemes in place in the United States, Europe and Japan with those of Canada, as well as anticipated developments in patent law in the future, to the extent that time permits.", 
        "subject": "LAW", 
        "number": "447", 
        "title": "Patent Law"
    }
}