{
    "basic": {
        "description": "This seminar focuses on the challenges of protecting information privacy against the threat of emerging technologies (such as biotechnology, internet communication technologies, information tracking technologies, cloud computing, biometrics, and surveillance technologies to name a few). Information has been central to the form and function of the knowledge economy and plays a vital role as between individuals and in relationship with the state, raising issues pertaining to its control, access, aggregation, storage, retrieval, use and dissemination. As a society, we are entering an era of big data with new technologies operationally interrogating existing dominant conceptions of privacy and introducing fresh areas of private contestation that question the need for a coherent theoretical framework. This course will survey the mixed regulatory mechanisms available for protecting information privacy in Canadian law, ranging from constitutional to statutory and common law protections, and will examine how normative conceptual understandings of privacy, and their necessary tradeoffs, mediate new technologies, civil liberties, democratic values, public policy, law and reform efforts. Is there a normative moral claim for protecting privacy beyond our reasonable expectation?  The course asks the questions of protection of ¿what¿ (what counts as personal information) from ¿whom¿ (are there differences to be drawn between the private and public uses of such information), in order to debate whether different regulatory responses are necessary and ¿why¿.", 
        "number": "617", 
        "subject": "LAW", 
        "title": "Information Privacy"
    }, 
    "extra": {
        "CEAB": {
            "Basic Sci": 0, 
            "Comp St": 0, 
            "Eng Des": 0, 
            "Eng Sci": 0, 
            "Math": 0
        }, 
        "career": "Graduate", 
        "course_components": {
            "Seminar": "Required"
        }, 
        "grading_basis": "Graded", 
        "units": "3.00"
    }
}