{
    "basic": {
        "description": "The course deals with a number of related issues concerning the treatment of children and adolescents in the legal system. Tactical, ethical and policy questions are addressed, as well as substantive and procedural legal topics. We will also explore the role of lawyers in a variety of proceedings affecting children and adolescents. While the primary focus of the course is legal and process oriented, the legal issues must be seen in a multi-disciplinary context, as is reflected in the reading materials and the range of professionals who will visit the class as speakers. Lawyers, judges, social workers, probation officers, youth workers and others will be guest speakers. The major topics in the course are: (1) child welfare, including child abuse and neglect, focussing primarily on child protection proceedings, but also considering criminal law issues, such as those relating to child witnesses and corporal punishment; (2) adoption; (3) youth justice issues. Although all social and economic classes are affected by the issues raised in this course, many of the issues studied in this course tend to disproportionately affect those who are socially or economically disadvantaged in society, and, for example, issues of aboriginal status arise in each section of the course. This course may be of particular relevance to students with an interest in Criminal or Family Law, although some students take this course out of general interest. Many of the topics discussed are matters of considerable public controversy. (To be offered jointly with LAW-519.) Three term hours. PREREQUISITE OR COREQUISITE: LAW-520 Family Law or permission of the instructor.",
        "number": "876",
        "subject": "LAW",
        "title": "Children's Law"
    },
    "extra": {
        "CEAB": {
            "Basic Sci": 0,
            "Comp St": 0,
            "Eng Des": 0,
            "Eng Sci": 0,
            "Math": 0
        },
        "career": "Graduate",
        "course_components": {
            "Lecture": "Required"
        },
        "grading_basis": "Graded",
        "typically_offered": "Spring",
        "units": "3.00"
    }
}