{
    "basic": {
        "description": "This seminar will consider recent topics of controversy and political debate in the field of intellectual property and the protection of knowledge goods. The purpose of this course is to provide students with the opportunity to critically examine some of the normative and theoretical underpinnings for legally protecting intellectual contributions and to foster an understanding of how these rationales play out in terms of politics, policy development, and legal doctrine in specific substantive areas. These insights are relevant to the selected special topics that focus on the relationship of intellectual property protection with culture, communication, development, trade, human rights, and the tension between national objectives and international obligations. Students are expected to have some basic substantive knowledge in at least one area of intellectual property law and to be eager to critically engage with advanced \"fringe\" issues of IP. Topics vary from year to year but may include copyright protection for oral works and folklore, the use of intellectual property to protect traditional and indigenous knowledge, biodiversity, biopiracy, and biocolonialism, the politics of property in the human genome and the patenting of life, the growing anti-competitive uses of intellectual property and proliferation of \"bad patents\", farmer's rights to save seeds, the trade related aspects of intellectual property and implications of expanding IPRs, trademark protection for geographic appellations, the special status of famous marks, and the effects of property fundamentalism on the promotion of progress in science and the useful arts. (To be offered jointly with LAW-469.) Three term hours.",
        "number": "869",
        "subject": "LAW",
        "title": "Advanced Intellectual Property"
    },
    "extra": {
        "CEAB": {
            "Basic Sci": 0,
            "Comp St": 0,
            "Eng Des": 0,
            "Eng Sci": 0,
            "Math": 0
        },
        "career": "Graduate",
        "course_components": {
            "Lecture": "Required"
        },
        "grading_basis": "Graded",
        "units": "3.00"
    }
}