{
    "basic": {
        "description": "FALL SESSION:  This course exposes students to the fundamental concepts in civil procedure in Ontario.  Students will become familiar with the Ontario Rules of Civil Procedure.   The course aims to be both practical and substantive.  Areas of study will include:  jurisdiction; limitation periods; commencing and defending an action; the steps in an action, including motions, discovery and pre-trial conferences; disposition without trial; alternatives to litigation; settlement; costs; trials; and appeals.  Students will also have an opportunity to view pleadings and affidavits.  Finally, students will be asked to assess and explore the efficacy of the civil justice system.                                                                                                     WINTER SESSION:    This course examines fundamental civil procedure concepts relevant to today's lawyers in Ontario. The course aims to provide a working knowledge of the terminology and doctrine surrounding practice in the civil justice system. The course also aims to introduce the Ontario Rules of Civil Procedure. The course provides an opportunity to get comfortable with creating standard court documents and understanding some strategy and policy behind the civil justice system. The course fosters the development of a broader sense of how the entire civil justice system operates through the principles of fairness, efficiency, and predictability to impact the lives of both lawyers and clients alike. Topics include starting a lawsuit; defending a lawsuit, discovery; pre-trial relief and disposition without trial; alternative dispute resolution; settlement and costs; juries, trials,",
        "number": "225",
        "subject": "LAW",
        "title": "Civil Procedure"
    },
    "extra": {
        "CEAB": {
            "Basic Sci": 0,
            "Comp St": 0,
            "Eng Des": 0,
            "Eng Sci": 0,
            "Math": 0
        },
        "career": "Graduate",
        "course_components": {
            "Lecture": "Required"
        },
        "enrollment_requirement": "LAW 225/226:  Limited to 2nd year and 3rd year students.",
        "grading_basis": "Graded",
        "units": "4.00"
    }
}