{
    "basic": {
        "description": "This seminar provides an overview of two aspects of the development of criminal law internationally. The first focuses on the developing jurisprudence and practical implementation of international criminal law. Since 1993 there has been a renewed interest in prosecuting persons who have committed crimes against humanity, war crimes and genocide with the establishment of international tribunals and mixed international/domestic tribunals. These Tribunals prosecute persons who allegedly committed such crimes during wars in the Former Yugoslavia, Rwanda, Sierra Leone, Cambodia and Indonesia. The focus will be on the development of the law applicable to individual criminal responsibility, international crimes, principles applicable in armed conflict, and command responsibility. The primary source will be the law and practice of the International Criminal Tribunal for the Former Yugoslavia, but also that of the Rwanda Tribunal, Sierra Leone Tribunal and the International Criminal Court. The second aspect of the course explores international aspects of Canadian criminal law, specifically extradition and Canada¿s cooperation internationally in relation to criminal matters. The extradition component of the course will explore the purpose of extradition, and how Canada gives effect to it, including  process and procedures. International policy development and cooperation will focus on instruments against drugs, crime and terrorism and on aspects of Canada¿s mutual legal assistance.",
        "number": "409",
        "subject": "LAW",
        "title": "International Criminal Law"
    },
    "extra": {
        "CEAB": {
            "Basic Sci": 0,
            "Comp St": 0,
            "Eng Des": 0,
            "Eng Sci": 0,
            "Math": 0
        },
        "career": "Graduate",
        "course_components": {
            "Lecture": "Required"
        },
        "enrollment_requirement": "Exclusion:  Maximum of 3.00 units from LAW409 or LAW410.",
        "grading_basis": "Graded",
        "typically_offered": "Spring",
        "units": "3.00"
    }
}