{
    "basic": {
        "description": "FALL SESSION: This course will provide an introductory overview of administrative law - which principally concerns the legal regulation and judicial supervision of the executive branch of government. The course will examine issues such as the content of procedural fairness, substantive compliance with statutory mandates, and the dilemmas associated with the judicial review of discretionary decision making, all in the context of a broad range of substantive areas of law ­including labour relations, municipal planning and zoning, constitutional, environmental, immigration, banking, and securities law, among others. The appropriate relationship between courts and administrative tribunals and officers is an overarching concern.  Students will develop an understanding of the executive and administrative processes of government and will appreciate some of the design or structural problems in creating a system of public interest decision-making which is efficient and effective while  recognizing valued individual interests and rights.                                                                   WINTER SESSION:   The primary focus of the course will be on the relationship between the courts and the executive and administrative branches of government; and on the role of judicial review of administrative action in the Canadian constitutional and governmental framework. In this context, the course will examine in detail the major bases for judicial review of administrative action - ultra vires action, jurisdictional error, abuse of discretion, error of law and procedural unfairness. As well, the various remedies, both common law and statutory, for unlawful administrative action will be considered. It is also the intention that, from the cases and other materials studied, the student will develop a better understanding of the executive and administrative processes and will appreciate some of the design or structural problems in creating a system of public interest decision-making which is efficient and effective and which recognizes and gives scope for valued individual interests and concerns.",
        "number": "427",
        "subject": "LAW",
        "title": "Administrative Law"
    },
    "extra": {
        "CEAB": {
            "Basic Sci": 0,
            "Comp St": 0,
            "Eng Des": 0,
            "Eng Sci": 0,
            "Math": 0
        },
        "career": "Graduate",
        "course_components": {
            "Lecture": "Required"
        },
        "grading_basis": "Graded",
        "units": "4.00"
    }
}