{
    "basic": {
        "description": "Queen's Legal Aid provides legal assistance to low-income area residents and to students at Queen's University. It also provides clinical legal experience to law students, helping them develop skill and confidence as legal professionals. Operating largely as a poverty law clinic, Queen's Legal Aid typically assists with criminal and quasi-criminal offences, landlord/tenant disputes, creditor/debtor matters, employment claims and income maintenance problems. Under close supervision by clinic lawyers, law students interview and counsel clients, research legal issues, draft legal memoranda, provide legal opinions, prepare pleadings, negotiate settlements and participate in trials before criminal and civil courts, as well as hearings before administrative tribunals. Approximately eighty students work on clients' files during the academic year. Up to twelve students are hired to take responsibility for the files from May through August. In the academic year following their summer employment, these students take on mentoring and administrative responsibilities and are eligible for academic credits as student leaders of Queen's Legal Aid. Second year students can obtain credits by registering in LAW-591. Third year students can obtain credits by registering in LAW-592. These credits are optional. They can either be allocated to one term or divided between two terms. They can also be accumulated during both second and third year law. Students interested in these credits should refer to information about the clinic in the Queen's Legal Aid chapter, and discuss any potential conflict of interest with the senior clinic lawyer. 2 credits, fall and/or winter terms. Can not be registered in LAW 418A/B in the same academic year with LAW 591, 591A/B, 592, or 592A/B", 
        "number": "591", 
        "subject": "LAW", 
        "title": "Queen's Legal Aid Credit 1"
    }, 
    "extra": {
        "CEAB": {
            "Basic Sci": 0, 
            "Comp St": 0, 
            "Eng Des": 0, 
            "Eng Sci": 0, 
            "Math": 0
        }, 
        "add_consent": "Department Consent Required", 
        "career": "Graduate", 
        "course_components": {
            "Individual Study": "Required"
        }, 
        "drop_consent": "Department Consent Required", 
        "grading_basis": "Pass/Fail", 
        "units": "2.00"
    }
}