{
    "basic": {
        "description": "Trademark law protect `trade identity¿ by providing private remedies for the unauthorized use of trade-marks and other distinctive indicia. Owners of trade-marks have the exclusive right, under the Trade-marks Act and in common law, to use a mark to indicate the source of a product or service, as well as for related intangibles of commercial value. While various torts of unfair competition will be discussed, the focus is on the federal Trademarks Act and its impact on private rights to regulate the use of trademarks, trade names and unfair competitive practices. Students will learn how the common law regulation of unfair competition (the tort of passing off) complements the statutory protections afforded for brands and logos that now dominate modern consumer culture. Some attention is given to theoretical justifications and normative frameworks for trade-mark protection; public policy objectives; the basis for making a trademark application and grounds for opposition, claims to title; the validity of a mark; infringement;  the relationship to the law of trade-names under common law and federal and provincial incorporation statutes; and international obligations to which Canadian law must conform, notably through the Paris Convention and Trade Related Aspects of Intellectual Property Agreement. Recent law reform efforts in Canada, if given effect, will significantly expand the definition of a trade-mark and promise to shift the law towards greater protection for unconventional marks. What impact can we anticipate this will have on commercial speech? Students learn how the interests of stakeholders, from the desire to prevent free-riding to the promotion of free competition and free expression to the consumer and public interest in protecting the integrity of trade in wares and services from confusion, have played out under Canadian law and how they may best be served.",
        "number": "451",
        "subject": "LAW",
        "title": "Trademarks & Unfair Competit."
    },
    "extra": {
        "CEAB": {
            "Basic Sci": 0,
            "Comp St": 0,
            "Eng Des": 0,
            "Eng Sci": 0,
            "Math": 0
        },
        "career": "Graduate",
        "course_components": {
            "Lecture": "Required"
        },
        "grading_basis": "Graded",
        "units": "3.00"
    }
}