{
    "basic": {
        "description": "Why should you care about Copyright law? Most aspects of our culture and communication are affected by the law of copyright, from the entertainment we consume or contribute to, to the buildings we live in, to our written and visual exchanges, and our use of the internet, copyright is an integral part of our lives and affects how we as a society relate, educate, create, earn a living, or simply participate in meaning making through the exercise of our freedom of expression. The year 2012 was a turning point in Canadian copyright law with significant legislative reforms and five Supreme Court of Canada decisions (the ¿pentalogy¿) that will shape the trajectory of Canadian law for years to come. The Copyright Act extends a limited term of protection to original literary, dramatic, musical and artistic works as well as neighbouring rights in a performer¿s performance, a maker¿s sound recording, and a broadcaster¿s of communication signal. This course provides a brief introduction to the field of intellectual property in order to situate copyright in the policy framework of industrial and cultural property. The theoretical rationales for and judicial understanding of the role and function of copyright are explored as means for examining the continued debates about the appropriate scope of rights, the need for limits, and the goal of ¿balance¿ to be given effect by copyright law and policy. The course is focused on two main issues: copyright subsistence and infringement, taking into consideration the difference between authorship and ownership, moral rights and economic rights, nature and extent of rights and the allowable exceptions, defences, and remedies (criminal and civil). How should copyright law evolve in the face of major technological shifts? We will also consider some of the legal means by which copyright is made to expand or contract in accordance with policy, through the use of internal doctrinal mechanisms such as the expression/idea dichotomy, the merger of expression with ideas, the allowable use of stock devices, and the freedom of users to deal fairly with copyrighted works, as with the new user generated content exception, all of which may give more or less effect to the public interest in expressive freedom and a vibrant public domain.  Copyright theory will be tested against its application, with some attention to international aspects of protection for the impact on domestic law reform, including the new legal characterization of tampering with digital locks and technological protection measures as infringement. The big question we seek to answer in all instances is: have we got the ¿balance¿ right?", 
        "number": "468", 
        "subject": "LAW", 
        "title": "Copyright Law"
    }, 
    "extra": {
        "CEAB": {
            "Basic Sci": 0, 
            "Comp St": 0, 
            "Eng Des": 0, 
            "Eng Sci": 0, 
            "Math": 0
        }, 
        "career": "Graduate", 
        "course_components": {
            "Lecture": "Required"
        }, 
        "grading_basis": "Graded", 
        "units": "3.00"
    }
}