{
    "basic": {
        "description": "The practicum consists of ten weeks of in-school practice as well as a three-week Alternative Practicum.  After an intensive orientation period at the Faculty of Education in September, Consecutive and final year Concurrent teacher candidates complete their teaching placement in selected Associate Schools.  The regular practicum is made up of two teaching blocks, six weeks in the fall term and four weeks in the winter term.   The fall term teaching block is split into two 3-week components.  After the first practicum component candidates complete five weeks of classes then return to the same Associate School for the second component (normally with the same Associate Teacher).  Candidates will normally return to the same Associate School, to work in a different division for the third component of the practicum in the winter term.  The schools are selected from a number of District School Boards encompassing geographic areas that include Kingston, Peterborough, Toronto, Ottawa, Brockville, Belleville, Oshawa, Mississauga and Waterloo.  Teacher candidates should be aware that they may be assigned to an Associate School outside their preferred area. Please note that candidates are responsible for their own travel and accommodation costs.  During the practicum, candidates work closely with associate teachers, school personnel and faculty liaisons.  The Alternative Practicum starts after the second practicum block.  The Alternative Practicum should relate to the candidate¿s Program Focus (FOCI) course.  Primary-Junior candidates who do not have a FOCI course must register in FOCI P00.  The Alternative Practicum for candidates in FOCI P00 might relate to their Educational Studies course (EDST), Foundations course (FOUN), or to be arranged in another setting approved by the FOCI P00 advisor.  Only candidates enrolled in the Outdoor and Experiential Education program will get experience in two teaching divisions in the fall term.  The OEE candidates will complete the third component of the practicum in an Ontario Outdoor or Experiential Education setting.", 
        "number": "190A", 
        "subject": "PRAC", 
        "title": "Conc Fin Yr & Consec Practicum"
    }, 
    "extra": {
        "CEAB": {
            "Basic Sci": 0, 
            "Comp St": 0, 
            "Eng Des": 0, 
            "Eng Sci": 0, 
            "Math": 0
        }, 
        "add_consent": "Department Consent Required", 
        "career": "Undergraduate", 
        "course_components": {
            "Practicum": "Required"
        }, 
        "drop_consent": "Department Consent Required", 
        "grading_basis": "Pass/Fail", 
        "units": "0.00"
    }
}