{
    "extra": {
        "add_consent": "Department Consent Required", 
        "course_components": {
            "Lecture": "Required"
        }, 
        "drop_consent": "Department Consent Required", 
        "CEAB": {
            "Basic Sci": 0, 
            "Math": 0, 
            "Eng Des": 0, 
            "Eng Sci": 0, 
            "Comp St": 0
        }, 
        "career": "Graduate", 
        "grading_basis": "Graded", 
        "typically_offered": "Fall", 
        "units": "3.00"
    }, 
    "basic": {
        "description": "Reproductive politics pertain to those who have power over reproduction and its consequences. This includes 1) those who manipulate reproductive choices to advance socio-political agendas and reinforce privilege, and, 2) those who resist such power plays. The focus of this advance course is on the ensuing tension between the two. Students will critically engage with feminist perspectives pertaining to the public and private meanings associated with reproduction and examine how these meanings are contingent on assumptions about gender, sex, class, race, sexuality, culture, physical (dis)ability, marital status, IQ and historical location. We will address such questions as: Is sexual difference necessarily determined by sexual reproduction?  How have maternal bodies been positioned in culture; differentiated; represented; valued as appropriate or inappropriate; constituted in relation to the bodies of fetuses, children, women who are not mothers? What is the relationship between the state and reproduction? How has medicine and science impacted reproductive choices and for whose benefit? How have population policies and globalization shaped reproductive politics? Does genetic engineering hold the promise of reproductive freedom? Importantly, we will examine how power and resistance are at the heart of each of these questions.  Not offered 2010-11.", 
        "subject": "SOCY", 
        "number": "933", 
        "title": "Reproductive And Body Politics"
    }
}